In [1]:
import sqlite3

In [2]:
# Create Connection
conn = sqlite3.connect('department.db')
cursor = conn.cursor()

In [3]:
# Create table employee
cursor.execute('''CREATE TABLE IF NOT EXISTS employee ( 
    emp_id INTEGER PRIMARY KEY AUTOINCREMENT, 
    manager_id INTEGER FORIEGN KEY,
    dep_id INTEGER FORIEGN KEY,
    first_name TEXT, 
    last_name TEXT,
    salary INTEGER)''')

In [4]:
# Add employees
cursor.executemany(
    'INSERT INTO employee (first_name, last_name, salary, manager_id, dep_id) VALUES (?, ?, ?, ?, ?)', [
    ('Amro', "Rabea", 10000, 1, 1),
    ('Mohammed', "Gomaa", 20000, 105, 1),
    ('Alice', 'Mike', 30000, 195, 2),
    ('Mohanad', 'Rabea', 40000, 201, 2),
])
conn.commit()

## TASK 1

In [5]:
cursor.execute("""
SELECT emp_id, last_name, salary
FROM employee
WHERE salary BETWEEN 10000 AND 40000
  AND manager_id NOT IN (101, 201);
""")
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'Rabea', 10000)
(2, 'Gomaa', 20000)
(3, 'Mike', 30000)

## TASK 2

In [6]:
# Create table employee
cursor.execute('''CREATE TABLE IF NOT EXISTS department ( 
    department_id INTEGER PRIMARY KEY AUTOINCREMENT,
    manager_id INTEGER FORIEGN KEY,
    name TEXT)''')

In [7]:
# Add employees
cursor.executemany(
    'INSERT INTO department (manager_id, name) VALUES (?, ?)', [
    (1, "Maadi dep"),
    (2, "Mokattam dep"),
])
conn.commit()

In [8]:
cursor.execute("""
SELECT e.first_name AS employee_name, d.name AS department_name
FROM employee e
INNER JOIN department d ON e.dep_id = d.department_id
ORDER BY d.name ASC
""")
results = cursor.fetchall()
for row in results:
    print(row)

('Amro', 'Maadi dep')
('Mohammed', 'Maadi dep')
('Alice', 'Mokattam dep')
('Mohanad', 'Mokattam dep')

## TASK 3

In [9]:
cursor.execute("""
SELECT d.department_id, COUNT(e.emp_id), AVG(e.salary)
FROM department d
JOIN employee e ON e.dep_id = d.department_id
GROUP BY d.department_id
ORDER BY d.department_id ASC
""")
results = cursor.fetchall()
for row in results:
    print(row)

(1, 2, 15000.0)
(2, 2, 35000.0)